TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib_cm/inc/hw_memcfg.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRCLR register
//
//*************************************************************************************************
#define MEMCFG_CERRCLR_M4RDERR     0x1U          // M4 Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_M4WRERR     0x2U          // M4 Correctable Write Error Flag Clear
#define MEMCFG_CERRCLR_EMACRDERR   0x4U          // EMAC Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_UDMARDERR   0x10U         // uDMA Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_UDMAWRERR   0x20U         // uDMA Correctable Write Error Flag Clear
#define MEMCFG_CERRCLR_KEY_S       16U
#define MEMCFG_CERRCLR_KEY_M       0xFFFF0000U   // KEY to allow write access

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTFLG register
//
//*************************************************************************************************
#define MEMCFG_CEINTFLG_CEINTFLAG   0x1U   // Total corrected error count exceeded threshold flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTSET register
//
//*************************************************************************************************
#define MEMCFG_CEINTSET_CEINTSET   0x1U          // Total corrected error count exceeded flag set.
#define MEMCFG_CEINTSET_KEY_S      16U
#define MEMCFG_CEINTSET_KEY_M      0xFFFF0000U   // KEY to allow write access

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTCLR register
//
//*************************************************************************************************
#define MEMCFG_CEINTCLR_CEINTCLR   0x1U          // M4 Corrected Error Threshold Exceeded Error
                                                 // Clear.
#define MEMCFG_CEINTCLR_KEY_S      16U
#define MEMCFG_CEINTCLR_KEY_M      0xFFFF0000U   // KEY to allow write access

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTEN register
//
//*************************************************************************************************
#define MEMCFG_CEINTEN_CEINTEN   0x1U          // M4 Correctable Error Interrupt Enable.
#define MEMCFG_CEINTEN_KEY_S     16U
#define MEMCFG_CEINTEN_KEY_M     0xFFFF0000U   // KEY to allow write access


//*************************************************************************************************
//
// The following are defines for the bit fields in the DIAGERRFLG register
//
//*************************************************************************************************
#define MEMCFG_DIAGERRFLG_UCRDERROR   0x1U   // Diagnostics Uncorrectable Read Error Flag
#define MEMCFG_DIAGERRFLG_UCWRERROR   0x2U   // Diagnostics Uncorrectable Write Error Flag
#define MEMCFG_DIAGERRFLG_CRDERROR    0x4U   // Diagnostics Correctable Read Error Flag
#define MEMCFG_DIAGERRFLG_CWRERROR    0x8U   // Diagnostics Correctable Write Error Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the DIAGERRCLR register
//
//*************************************************************************************************
#define MEMCFG_DIAGERRCLR_UCRDERROR   0x1U   // Clear diagnostics uncorrectable Read Error Flag
#define MEMCFG_DIAGERRCLR_UCWRERROR   0x2U   // Clear diagnostics uncorrectable Write Error Flag
#define MEMCFG_DIAGERRCLR_CRDERROR    0x4U   // Clear diagnostics correctable Read Error Flag
#define MEMCFG_DIAGERRCLR_CWRERROR    0x8U   // Clear diagnostics correctable Write Error Flag



#endif
